{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "pants-fire",
    "1": "false",
    "2": "barely-true",
    "3": "half-true",
    "4": "mostly-true",
    "5": "true"
  },
  "initializer_range": 0.02,
  "label2id": {
    "barely-true": 2,
    "false": 1,
    "half-true": 3,
    "mostly-true": 4,
    "pants-fire": 0,
    "true": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.0",
  "vocab_size": 30522
}
